#### terraform plan every: bc51db9
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.lambda-sample.aws_api_gateway_api_key.example: Refreshing state... [id=ryf1igrci7]
module.lambda-sample.aws_api_gateway_rest_api.discord_endpoint: Refreshing state... [id=jf9xts7cpa]
module.lambda-sample.aws_iam_role.lambda_iam_role: Refreshing state... [id=lambda_sample_python_iam_role]
module.lambda-sample.aws_lambda_layer_version.lambda_layer: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:554506578892:layer:lambda_sample_python_lambda_layer:4]
module.lambda-sample.aws_iam_role_policy.lambda_access_policy: Refreshing state... [id=lambda_sample_python_iam_role:lambda_sample_python_lambda_access_policy]
module.lambda-sample.aws_lambda_function.lambda_function: Refreshing state... [id=lambda_sample_python_function]
module.lambda-sample.aws_api_gateway_resource.hello_world: Refreshing state... [id=bz2mjd]
module.lambda-sample.aws_api_gateway_method.hello_world: Refreshing state... [id=agm-jf9xts7cpa-bz2mjd-POST]
module.lambda-sample.aws_lambda_permission.hello_world: Refreshing state... [id=terraform-20210512072946336100000001]
module.lambda-sample.aws_api_gateway_method_response.hello_world: Refreshing state... [id=agmr-jf9xts7cpa-bz2mjd-POST-200]
module.lambda-sample.aws_api_gateway_integration.hello_world: Refreshing state... [id=agi-jf9xts7cpa-bz2mjd-POST]
module.lambda-sample.aws_api_gateway_deployment.example: Refreshing state... [id=i4li9a]
module.lambda-sample.aws_api_gateway_usage_plan.example: Refreshing state... [id=49l6jo]
module.lambda-sample.aws_api_gateway_usage_plan_key.example: Refreshing state... [id=ryf1igrci7]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.lambda-sample.aws_api_gateway_deployment.example must be replaced
+/- resource "aws_api_gateway_deployment" "example" {
      ~ created_date      = "2021-05-12T07:43:12Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:ap-northeast-1:554506578892:jf9xts7cpa/example" -> (known after apply)
      ~ id                = "i4li9a" -> (known after apply)
      ~ invoke_url        = "https://jf9xts7cpa.execute-api.ap-northeast-1.amazonaws.com/example" -> (known after apply)
      ~ stage_description = "timestamp = 2021-05-12T07:43:12Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.lambda-sample.aws_lambda_function.lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_function" {
        id                             = "lambda_sample_python_function"
      ~ layers                         = [
          - "arn:aws:lambda:ap-northeast-1:554506578892:layer:lambda_sample_python_lambda_layer:4",
        ] -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.lambda-sample.aws_lambda_layer_version.lambda_layer must be replaced
+/- resource "aws_lambda_layer_version" "lambda_layer" {
      ~ arn                         = "arn:aws:lambda:ap-northeast-1:554506578892:layer:lambda_sample_python_lambda_layer:4" -> (known after apply)
      - compatible_runtimes         = [] -> null
      ~ created_date                = "2021-05-12T07:31:43.604+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-northeast-1:554506578892:layer:lambda_sample_python_lambda_layer:4" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-northeast-1:554506578892:layer:lambda_sample_python_lambda_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "7ojlWeGoEle7e77o/XEr1xFzLrSsupMOmm8aHhISqUg=" -> "d3pRokMD4GKwseZyjYbmWbKp3O7U7KCEY3YkWVT6SZA=" # forces replacement
      ~ source_code_size            = 2506397 -> (known after apply)
      ~ version                     = "4" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

Changes to Outputs:
  ~ base_url = "https://jf9xts7cpa.execute-api.ap-northeast-1.amazonaws.com/example" -> (known after apply)

Warning: Value for undeclared variable

The root module does not declare a variable named "cert_arn" but a value was
found in file "dev.auto.tfvars". If you meant to use this value, add a
"variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>




*Pusher: @lazmond3, Action: `pull_request`*